tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/core"
tap "homebrew/services"
tap "homebrew/cask-versions"
tap "homebrew/cask-drivers"
tap "heroku/brew"

# ops
brew "git"
brew "fish"
brew "gnupg"

# very necessary tools
brew "wget"
brew "mas"
brew "htop"
brew "neofetch"

# productivity
brew "exa"
brew "fd"
brew "hexyl"
brew "typora"

# dev
brew "sqlite"
brew "postgresql"
brew "pyenv"
brew "docker"
brew "heroku"
brew "node"
brew "yarn"
brew "dokku/repo/dokku"

if ENV.key? 'CI_MODE'
# font
cask "font-fira-code"

cask "google-chrome"
cask "visual-studio-code"
cask "iterm2"
cask "postgres"
cask "rectangle"
cask "dropbox"
cask "postman"
cask "skype"
cask "postman"
cask "electrum"
cask "zoomus"
cask "notion"
cask "nomachine"
cask "spotify"
cask "slack"
end